{
    "title": "Newly Built 5 Bedroom/3 Bathroom Home in Milford",
    "address": {
        "street": "3/123 Forrest Hill Rd",
        "suburb": "Milford",
        "city": "Auckland",
        "postcode": "0620"
    },
    "rooms":{
        "bedrooms": 5,
        "bathrooms": 3
    },
    "property_type": "House",
    "weekly_rent": 1150,
    "tenents": "Upto 10",
    "smoking": "No Smoking Allowed",
    "pets": "Pets Allowed",
    "available_from": "now",
    "agent_details":{
        "agent_name": "Caroline Li",
        "agent_email": "caroline.li@aucklandproperty.net",
        "agent_phone": "021737909"
    },
    "description": "Please TEXT 021737909 to book a viewing time. This brand new elegant family home offers you the best of modern living. The ground floor plans are designed to make life as comfortable and convenient as possible with excellent flow for entertaining and daily routines. Wooden floors throughout the lower level lead from front entry to an open plan, spacious dining and lounge area that flows nicely to the outdoor deck area. A beautiful kitchen with modern appliances and a separate pantry area fitted with an extra sink and hob offering additional storage space, 1 double bedroom and a bathroom complete the ground level. Upstairs comprises of a spacious master bedroom with an ensuite and a walk-in wardrobe, 3 additional double bedrooms and another bathroom. Great location within the desirable suburb of Milford offers easy access to motorways with Wairau Valley, Milford Beach, local supermarkets and cafes just a quick commute away. Parking: Single car garage plus 1 carpark in front of the house. Move-in costs: 4 weeks rent as bond plus 1st week rent. No Smokers/ No Pets TO REGISTER FOR THE VIEWING: https://www.2book.com.au/RegisterNewNZ?agentID=APM&uniqueID=APM32955 TO APPLY: https://apply.tpsportal.co.nz/6172007? *You MUST register to confirm your attendance at a viewing. This will also enable us to inform you instantly of any changes, updates or cancellations to this viewing.* ** If there are no registered attendees for a viewing, that particular viewing may be cancelled – so if you wish to attend, please ensure you register by using the EMAIL THE AGENT BUTTON BELOW. We would also suggest that before the viewing, you do a drive past of the property to ascertain the suitability of the area. **"
}